In [65]:
import pandas as pd
import matplotlib.pyplot as plt

In [66]:
df = pd.read_excel('transacoes.xlsx')
df

,Tipo,Descrição,Categoria,Valor,Forma de Transação,Ano,Mês,Dia,Hora
0,Entrada,Mauro,Outros,60.00,Pix,2024,9,1,NaN
1,Saída,Valeska,Outros,30.00,Pix,2024,9,1,NaN
2,Saída,Charles,Outros,6.50,Cartão,2024,9,3,NaN
3,Saída,Paula,Outros,17.32,Pix,2024,9,3,NaN
4,Saída,Padaria,Alimento,0.90,Fiado,2024,9,3,NaN
...,...,...,...,...,...,...,...,...,...
201,Saída,Ifood,Alimento,10.00,Pix,2024,10,13,NaN
202,Saída,Padaria,Alimento,2.70,Pix,2024,10,13,NaN
203,Saída,Confiança,Alimento,13.18,Pix,2024,10,14,NaN
204,Entrada,Leandro,Outros,90.00,Pix,2024,10,14,NaN
205,Saída,Academia,Esporte,129.90,Dinheiro,2024,10,14,NaN

In [67]:
df = df.drop('Hora', axis=1)
df

        Tipo  Descrição Categoria   Valor Forma de Transação   Ano  Mês  Dia
0    Entrada      Mauro    Outros   60.00                Pix  2024    9    1
1      Saída    Valeska    Outros   30.00                Pix  2024    9    1
2      Saída    Charles    Outros    6.50             Cartão  2024    9    3
3      Saída      Paula    Outros   17.32                Pix  2024    9    3
4      Saída    Padaria  Alimento    0.90              Fiado  2024    9    3
..       ...        ...       ...     ...                ...   ...  ...  ...
201    Saída      Ifood  Alimento   10.00                Pix  2024   10   13
202    Saída    Padaria  Alimento    2.70                Pix  2024   10   13
203    Saída  Confiança  Alimento   13.18                Pix  2024   10   14
204  Entrada    Leandro    Outros   90.00                Pix  2024   10   14
205    Saída   Academia   Esporte  129.90           Dinheiro  2024   10   14

[206 rows x 8 columns]

In [68]:
df = df[df['Categoria'] != 'Empestimo']
df

        Tipo  Descrição Categoria   Valor Forma de Transação   Ano  Mês  Dia
0    Entrada      Mauro    Outros   60.00                Pix  2024    9    1
1      Saída    Valeska    Outros   30.00                Pix  2024    9    1
2      Saída    Charles    Outros    6.50             Cartão  2024    9    3
3      Saída      Paula    Outros   17.32                Pix  2024    9    3
4      Saída    Padaria  Alimento    0.90              Fiado  2024    9    3
..       ...        ...       ...     ...                ...   ...  ...  ...
201    Saída      Ifood  Alimento   10.00                Pix  2024   10   13
202    Saída    Padaria  Alimento    2.70                Pix  2024   10   13
203    Saída  Confiança  Alimento   13.18                Pix  2024   10   14
204  Entrada    Leandro    Outros   90.00                Pix  2024   10   14
205    Saída   Academia   Esporte  129.90           Dinheiro  2024   10   14

[204 rows x 8 columns]

In [80]:
frequecia_categoria = df['Categoria'].value_counts()
frequecia_categoria

Categoria
Transporte    67
Alimento      49
Outros        44
Lazer         25
Salário        6
Moradia        4
Esporte        4
Emprestimo     4
Roupas         1
Name: count, dtype: int64

In [81]:
# Valor total por categoria
categoria_soma = df.groupby('Categoria')['Valor'].sum()
categoria_soma

Categoria
Alimento      1010.36
Emprestimo     317.00
Esporte        363.80
Lazer          677.20
Moradia       1600.00
Outros        2065.41
Roupas         238.00
Salário       3841.11
Transporte     443.47
Name: Valor, dtype: float64

In [82]:
frequencia_formas = df['Forma de Transação'].value_counts()
frequencia_formas

Forma de Transação
Pix         131
Dinheiro     28
Fiado        16
Outro        15
Cartão       14
Name: count, dtype: int64

In [83]:
# Valor total por Forma de trasação

forma_soma = df.groupby('Forma de Transação')['Valor'].sum()
forma_soma

Forma de Transação
Cartão       227.65
Dinheiro     852.58
Fiado       1729.53
Outro        708.60
Pix         7037.99
Name: Valor, dtype: float64

In [90]:
# Análises Combinatórias das Formas
df_soma_freque_forma = pd.concat([frequencia_formas, forma_soma], axis=1)
df_soma_freque_forma.rename(columns={'Forma de Transação' : 'Forma', 'count' : 'Frequência', 'Valor' : 'Valor Total'})

                    Frequência  Valor Total
Forma de Transação
Pix                        131      7037.99
Dinheiro                    28       852.58
Fiado                       16      1729.53
Outro                       15       708.60
Cartão                      14       227.65

In [87]:
# Análises Combinatórias das Categorias
df_soma_freque_Categoria = pd.concat([frequecia_categoria, categoria_soma], axis=1)
df_soma_freque_Categoria.rename(columns={'count':'Frequência', 'Valor':'Valor Total'})

            Frequência  Valor Total
Categoria
Transporte          67       443.47
Alimento            49      1010.36
Outros              44      2065.41
Lazer               25       677.20
Salário              6      3841.11
Moradia              4      1600.00
Esporte              4       363.80
Emprestimo           4       317.00
Roupas               1       238.00